; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-6)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 10679)
	(= (fuel plane1) 55)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 15)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 9)
	(at plane2 city2)
	(= (capacity plane2) 12490)
	(= (fuel plane2) 4012)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 10)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 2)
	(at plane3 city1)
	(= (capacity plane3) 14341)
	(= (fuel plane3) 4516)
	(= (slow-burn plane3) 5)
	(= (fast-burn plane3) 18)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 4)
	(at plane4 city4)
	(= (capacity plane4) 12259)
	(= (fuel plane4) 2601)
	(= (slow-burn plane4) 5)
	(= (fast-burn plane4) 13)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 5)
	(at plane5 city5)
	(= (capacity plane5) 10612)
	(= (fuel plane5) 2331)
	(= (slow-burn plane5) 5)
	(= (fast-burn plane5) 16)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 8)
	(at person1 city3)
	(at person2 city1)
	(at person3 city5)
	(at person4 city9)
	(at person5 city3)
	(at person6 city5)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 559)
	(= (distance city0 city2) 621)
	(= (distance city0 city3) 936)
	(= (distance city0 city4) 664)
	(= (distance city0 city5) 543)
	(= (distance city0 city6) 602)
	(= (distance city0 city7) 703)
	(= (distance city0 city8) 506)
	(= (distance city0 city9) 591)
	(= (distance city1 city0) 559)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 725)
	(= (distance city1 city3) 762)
	(= (distance city1 city4) 797)
	(= (distance city1 city5) 953)
	(= (distance city1 city6) 878)
	(= (distance city1 city7) 507)
	(= (distance city1 city8) 966)
	(= (distance city1 city9) 646)
	(= (distance city2 city0) 621)
	(= (distance city2 city1) 725)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 772)
	(= (distance city2 city4) 545)
	(= (distance city2 city5) 535)
	(= (distance city2 city6) 771)
	(= (distance city2 city7) 758)
	(= (distance city2 city8) 826)
	(= (distance city2 city9) 745)
	(= (distance city3 city0) 936)
	(= (distance city3 city1) 762)
	(= (distance city3 city2) 772)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 824)
	(= (distance city3 city5) 804)
	(= (distance city3 city6) 952)
	(= (distance city3 city7) 909)
	(= (distance city3 city8) 888)
	(= (distance city3 city9) 522)
	(= (distance city4 city0) 664)
	(= (distance city4 city1) 797)
	(= (distance city4 city2) 545)
	(= (distance city4 city3) 824)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 700)
	(= (distance city4 city6) 947)
	(= (distance city4 city7) 644)
	(= (distance city4 city8) 637)
	(= (distance city4 city9) 612)
	(= (distance city5 city0) 543)
	(= (distance city5 city1) 953)
	(= (distance city5 city2) 535)
	(= (distance city5 city3) 804)
	(= (distance city5 city4) 700)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 687)
	(= (distance city5 city7) 739)
	(= (distance city5 city8) 815)
	(= (distance city5 city9) 694)
	(= (distance city6 city0) 602)
	(= (distance city6 city1) 878)
	(= (distance city6 city2) 771)
	(= (distance city6 city3) 952)
	(= (distance city6 city4) 947)
	(= (distance city6 city5) 687)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 831)
	(= (distance city6 city8) 540)
	(= (distance city6 city9) 956)
	(= (distance city7 city0) 703)
	(= (distance city7 city1) 507)
	(= (distance city7 city2) 758)
	(= (distance city7 city3) 909)
	(= (distance city7 city4) 644)
	(= (distance city7 city5) 739)
	(= (distance city7 city6) 831)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 628)
	(= (distance city7 city9) 993)
	(= (distance city8 city0) 506)
	(= (distance city8 city1) 966)
	(= (distance city8 city2) 826)
	(= (distance city8 city3) 888)
	(= (distance city8 city4) 637)
	(= (distance city8 city5) 815)
	(= (distance city8 city6) 540)
	(= (distance city8 city7) 628)
	(= (distance city8 city8) 0)
	(= (distance city8 city9) 835)
	(= (distance city9 city0) 591)
	(= (distance city9 city1) 646)
	(= (distance city9 city2) 745)
	(= (distance city9 city3) 522)
	(= (distance city9 city4) 612)
	(= (distance city9 city5) 694)
	(= (distance city9 city6) 956)
	(= (distance city9 city7) 993)
	(= (distance city9 city8) 835)
	(= (distance city9 city9) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane3 city8)
	(at person1 city5)
	(at person2 city6)
	(at person3 city9)
	(at person4 city1)
	(at person5 city6)
	(at person6 city0)
	))

(:metric minimize (+ (* 1 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (fly plane2 city2 city3)
   deleted: (at plane2 city2)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 0 to 3860, (fuel plane2) from 4012 to 152
   goals met: 0 of 7
2. (board person6 plane5 city5)
   deleted: (at person6 city5)
   added: (in person6 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 0 of 7
3. (board person2 plane3 city1)
   deleted: (at person2 city1)
   added: (in person2 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 0 of 7
4. (refuel plane5 city5)
   changed: (fuel plane5) from 2331 to 10612
   goals met: 0 of 7
5. (fly plane3 city1 city6)
   deleted: (at plane3 city1)
   added: (at plane3 city6)
   changed: (total-fuel-used) from 3860 to 8250, (fuel plane3) from 4516 to 126
   goals met: 0 of 7
6. (debark person2 plane3 city6)
   deleted: (in person2 plane3)
   added: (at person2 city6)
   changed: (onboard plane3) from 1 to 0
   goals met: 1 of 7
7. (refuel plane3 city6)
   changed: (fuel plane3) from 126 to 14341
   goals met: 1 of 7
8. (board person3 plane5 city5)
   deleted: (at person3 city5)
   added: (in person3 plane5)
   changed: (onboard plane5) from 1 to 2
   goals met: 1 of 7
9. (fly plane5 city5 city9)
   deleted: (at plane5 city5)
   added: (at plane5 city9)
   changed: (total-fuel-used) from 8250 to 11720, (fuel plane5) from 10612 to 7142
   goals met: 1 of 7
10. (debark person3 plane5 city9)
   deleted: (in person3 plane5)
   added: (at person3 city9)
   changed: (onboard plane5) from 2 to 1
   goals met: 2 of 7
11. (board person4 plane5 city9)
   deleted: (at person4 city9)
   added: (in person4 plane5)
   changed: (onboard plane5) from 1 to 2
   goals met: 2 of 7
12. (fly plane5 city9 city0)
   deleted: (at plane5 city9)
   added: (at plane5 city0)
   changed: (total-fuel-used) from 11720 to 14675, (fuel plane5) from 7142 to 4187
   goals met: 2 of 7
13. (debark person6 plane5 city0)
   deleted: (in person6 plane5)
   added: (at person6 city0)
   changed: (onboard plane5) from 2 to 1
   goals met: 3 of 7
14. (fly plane5 city0 city1)
   deleted: (at plane5 city0)
   added: (at plane5 city1)
   changed: (total-fuel-used) from 14675 to 17470, (fuel plane5) from 4187 to 1392
   goals met: 3 of 7
15. (debark person4 plane5 city1)
   deleted: (in person4 plane5)
   added: (at person4 city1)
   changed: (onboard plane5) from 1 to 0
   goals met: 4 of 7
16. (fly plane3 city6 city3)
   deleted: (at plane3 city6)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 17470 to 22230, (fuel plane3) from 14341 to 9581
   goals met: 4 of 7
17. (board person1 plane3 city3)
   deleted: (at person1 city3)
   added: (in person1 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 4 of 7
18. (board person5 plane3 city3)
   deleted: (at person5 city3)
   added: (in person5 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 4 of 7
19. (fly plane3 city3 city5)
   deleted: (at plane3 city3)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 22230 to 26250, (fuel plane3) from 9581 to 5561
   goals met: 4 of 7
20. (debark person1 plane3 city5)
   deleted: (in person1 plane3)
   added: (at person1 city5)
   changed: (onboard plane3) from 2 to 1
   goals met: 5 of 7
21. (fly plane3 city5 city8)
   deleted: (at plane3 city5)
   added: (at plane3 city8)
   changed: (total-fuel-used) from 26250 to 30325, (fuel plane3) from 5561 to 1486
   goals met: 6 of 7
22. (refuel plane3 city8)
   changed: (fuel plane3) from 1486 to 14341
   goals met: 6 of 7
23. (fly plane3 city8 city6)
   deleted: (at plane3 city8)
   added: (at plane3 city6)
   changed: (total-fuel-used) from 30325 to 33025, (fuel plane3) from 14341 to 11641
   goals met: 5 of 7
24. (debark person5 plane3 city6)
   deleted: (in person5 plane3)
   added: (at person5 city6)
   changed: (onboard plane3) from 1 to 0
   goals met: 6 of 7
25. (fly plane3 city6 city8)
   deleted: (at plane3 city6)
   added: (at plane3 city8)
   changed: (total-fuel-used) from 33025 to 35725, (fuel plane3) from 11641 to 8941
   goals met: 7 of 7
